Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Салон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Салоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Салон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Салоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Движения.Остатки.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Товар КАК Товар,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество,
		|	РасходнаяНакладнаяТовары.Ссылка.Салон КАК Салон
		|ПОМЕСТИТЬ ВтТребуетсяСписать
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиОстатки.Товар КАК Товар,
		|	ОстаткиОстатки.Партия КАК Партия,
		|	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиОстатки.СтоимостьОстаток КАК СтоимостьОстаток
		|ПОМЕСТИТЬ ВтОстаткиПоПартиям
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(
		|			&Период,
		|			(Товар, Салон) В
		|				(ВЫБРАТЬ
		|					ВтТребуетсяСписать.Товар КАК Товар,
		|					ВтТребуетсяСписать.Салон КАК Салон
		|				ИЗ
		|					ВтТребуетсяСписать КАК ВтТребуетсяСписать)) КАК ОстаткиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТребуетсяСписать.Товар КАК Товар,
		|	ВтТребуетсяСписать.Количество КАК Количество,
		|	ВтОстаткиПоПартиям.Партия КАК Партия,
		|	ЕСТЬNULL(ВтОстаткиПоПартиям.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВтОстаткиПоПартиям.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|ИЗ
		|	ВтТребуетсяСписать КАК ВтТребуетсяСписать
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиПоПартиям КАК ВтОстаткиПоПартиям
		|		ПО ВтТребуетсяСписать.Товар = ВтОстаткиПоПартиям.Товар
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Товар";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл    
		
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда 
			Нехватка = Выборка.Количество - Выборка.КоличествоОстаток;
			Сообщить("Нехватка товара " + Выборка.Товар + ". В размере " + Нехватка + " единиц");
			Отказ = Истина;
		КонецЕсли;
			
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		ТребуетсяПереместить = Выборка.Количество;
		КСписанию = 0;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() И ТребуетсяПереместить > 0 Цикл
			
			Если ТребуетсяПереместить > Выборка.КоличествоОстаток Тогда
				ТребуетсяПереместить = ТребуетсяПереместить - Выборка.КоличествоОстаток;
			    КСписанию = Выборка.КоличествоОстаток;
				
			Иначе
				КСписанию = ТребуетсяПереместить; 
				ТребуетсяПереместить = 0;  				
			КонецЕсли;  
			
			// регистр Остатки Расход
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = Выборка.Товар;
			Движение.Салон = Салон;
			Движение.Партия = Выборка.Партия;
			Движение.Количество = КСписанию;  
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры
